site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@

** Introduction to Dynamic Programming
:PROPERTIES:
:EXPORT_FILE_NAME: dynamic_programming
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :weight 7 :date 2022-08-22 :publishdate 2022-07-01
:ID:       3ed6c54b-200a-4a1f-b20b-3953698f305b
:END:

Greedy algorithms are fun, but sometimes you need more power than what they can give you.  Like Greedy problems, Dynamic Programming (DP)
problems have overlapping optimal substructure.  Unfortunately, what is often the best local choice can end up *not* giving you the best
global solution.  Dynamic programming allows us to take advantage of the overlapping substructure property to speed up the search.

*** Slides
- [[/slides/dynamic-programming.pdf][Dynamic Programming Slides]]

